modules/core/connection/atlas/chart.dot
digraph {
  edge [arrowhead="normal",color="white"]
  graph [layout="dot",bgcolor="#1c1c1c",rankdir="TB",ranksep="1.5"]
  node [shape="box",style="filled",fontcolor="white",color="transparent"]
  ":api:actual" [fillcolor="#160185"]
  ":api:builder" [fillcolor="#160185"]
  ":budget:model" [fillcolor="#160185"]
  ":codegen:annotation" [fillcolor="#160185"]
  ":core:connection" [fillcolor="#160185"]
  ":core:model" [fillcolor="#160185"]
  ":logging" [fillcolor="#160185"]
  ":prefs" [fillcolor="#160185"]
  ":api:actual" -> ":budget:model" [style="bold"]
  ":api:actual" -> ":codegen:annotation" [style="dashed"]
  ":api:actual" -> ":core:model" [style="bold"]
  ":api:builder" -> ":core:model" [style="bold"]
  ":api:builder" -> ":logging" [style="dashed"]
  ":core:connection" -> ":api:actual" [style="bold"]
  ":core:connection" -> ":api:builder" [style="bold"]
  ":core:connection" -> ":core:model" [style="dashed"]
  ":core:connection" -> ":logging" [style="dashed"]
  ":core:connection" -> ":prefs" [style="dashed"]
  ":prefs" -> ":core:model" [style="bold"]
}
